# Задача 32: Определить индексы элементов массива (списка),
# значения которых принадлежат заданному диапазону (т.е. не
# меньше заданного минимума и не больше заданного
# максимума)
# Ввод: [-5, 9, 0, 3, -1, -2, 1,
# 4, -2, 10, 2, 0, -9, 8, 10, -9,
# 0, -5, -5, 7]
# Вывод: [1, 9, 13, 14, 19]

lst_elem = [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
min_elem = int(input("Введите минимальный элемент: "))
max_elem = int(input("Введите максимальный элемент: "))
new_lst = [i for i  in range(len(lst_elem)) if min_elem <= lst_elem[i] <= max_elem]
print(new_lst)

